src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <attributes>
    <name>ДатаВремяСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОписанияПоОбъектам/ОписанияПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияПоОбъектам</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияВФайлах/ОписанияВФайлах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияВФайлах</name>
  <resources>
    <name>РасположениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияВХранилищах/ОписанияВХранилищах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияВХранилищах</name>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Задачи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Описание", Описание);	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РедакторОписания", РедакторОписания);	


КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОписанияПоОбъектам.Описание,
		|	ОписанияВХранилищах.Хранилище,
		|	ОписанияВФайлах.РасположениеФайла
		|ИЗ
		|	РегистрСведений.ОписанияПоОбъектам КАК ОписанияПоОбъектам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписанияВФайлах КАК ОписанияВФайлах
		|		ПО ОписанияПоОбъектам.Описание = ОписанияВФайлах.Описание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписанияВХранилищах КАК ОписанияВХранилищах
		|		ПО ОписанияПоОбъектам.Описание = ОписанияВХранилищах.Описание
		|ГДЕ
		|	ОписанияПоОбъектам.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	Описание = ВыборкаДетальныеЗаписи.Описание;
	РедакторОписания = ВыборкаДетальныеЗаписи.Хранилище.Получить();



КонецПроцедуры
